zaikou/msp430-launchpad-WiredSRM-ANTpuls-Converter/UnQo_TX_20131118_github_main.c
    if(Rotation_event_counter >= 0xFF)
        Rotation_event_counter = 0x00;

}

// Sends sendPower_CTF1_Calibration
void sendPower_CTF1_CAL()
{
    uchar setup[10];

    setup[0] = 0x4e;                                    //broadcast data
    setup[1] = ANT_CH_ID;                               //0x41;     //
    setup[2] = 0x01;                                    //Data page Number : Calibration massage
    setup[3] = 0x10;                                    //Calibration ID : CTF defined massage
    setup[4] = 0x01;                                    //CTF Defined ID : Zero offset
    setup[5] = 0xFF;                                    //Reserved :
    setup[6] = 0xFF;                                    //Reserved :
    setup[7] = 0xFF;                                    //Reserved :
    setup[8] = ((0xFF00 & ctf_torque_ticks2) >>8);      //Offset MSB
    setup[9] = ( 0x00FF & ctf_torque_ticks2);           //Offset LSB
    txMessage(setup, sizeof(setup));
}


int calc_time_diff(int end_t,int start_t)
{
	/*TAIFGフラグを使ってもいいんだけど…*/

    if(end_t >= start_t)
        return((unsigned int)(end_t - start_t));
    else	/* if timer return to 0 */
        return((unsigned int)((0xffff - start_t) + 1 + end_t));
}


//------------------------------------------------------------------------------
// main()
//------------------------------------------------------------------------------
void main(void)
{
    WDTCTL = WDTPW + WDTHOLD;               // Stop watchdog timer

    DCOCTL = 0x00;                          // Set DCOCLK to 1MHz
    BCSCTL1 = CALBC1_1MHZ;
    DCOCTL = CALDCO_1MHZ;

    BCSCTL1 |= DIVA_3;                      // ACLK/8   32768/8=4096 0X1000

    // P1.X  setup
    P1OUT = 0x00;                           // Initialize all GPIO
    P1OUT |= BIT3;                          // P1.3 SW is VDD pulled up
    P1SEL = 0x00;
    P1DIR = 0xFF;

    P1SEL = UART_TXD + UART_RXD;            // Timer function for TXD/RXD pins
    P1DIR = 0xFF & ~UART_RXD;               // Set all pins but RXD to output

// P1.6 LED setup
    P1DIR |=  BIT6;

// 1.0 LED setup
    P1DIR |=  BIT0;

    __enable_interrupt();
    TimerA_UART_init();                     // Start Timer_A UART

// ANT chip configuration
    P1OUT |= BIT0;                         //LED ON P1.0

    reset();
    P1OUT |= BIT0;
    __delay_cycles(5000);                  // Delay between comm cycles
    P1OUT &= ~BIT0;
    //__delay_cycles(5000);

    ANTAP1_AssignNetwork();
    P1OUT |= BIT0;
    __delay_cycles(5000);                  // Delay between comm cycles
    P1OUT &= ~BIT0;
    //__delay_cycles(5000);

    assignch();
    P1OUT |= BIT0;
    __delay_cycles(5000);                  // Delay between comm cycles
    P1OUT &= ~BIT0;
    //__delay_cycles(5000);

    setrf();
    P1OUT |= BIT0;
    __delay_cycles(5000);                  // Delay between comm cycles
    P1OUT &= ~BIT0;
    //__delay_cycles(5000);

    setchperiod();
    P1OUT |= BIT0;
    __delay_cycles(5000);                  // Delay between comm cycles
    P1OUT &= ~BIT0;
    //__delay_cycles(5000);

//  setInfoData();
    setchid();
    P1OUT |= BIT0;
    __delay_cycles(5000);                  // Delay between comm cycles
    P1OUT &= ~BIT0;
    //__delay_cycles(5000);

//    ChannelPower();
//    P1OUT |= BIT0;
//     __delay_cycles(5000);               // Delay between comm cycles
//     P1OUT &= ~BIT0;
//     __delay_cycles(5000);

    opench();
    P1OUT |= BIT0;
    __delay_cycles(5000);         // Delay between comm cycles
    P1OUT &= ~BIT0;
    //__delay_cycles(5000);

    __delay_cycles(250000);       // Delay between comm cycles
    P1OUT &= ~BIT0;               //LED OFF P1.0
//    __delay_cycles(250000);     // Delay between comm cycles

    P1DIR &= ~BIT3;               // config P1-3 port set to input
    P1OUT |= BIT3;                // set to Output
    P1IES |= BIT3;                // interrupt edge to H -> L edge


// 2.2 pin for pulse ticket capture
    P1OUT |=  BIT0;               //LED ON P1.0
    P2DIR &= ~BIT2;               // INPUT mode
    P2REN |= BIT2;                // pull up enable
    P2OUT |= BIT2;                // pull VDD
    P2IES |= BIT2;                // H -> L edge

//    __delay_cycles(250000);     // Delay between comm cycles
    P1OUT &= ~BIT0;               //LED OFF P1.0

// P2.0 set to TimerA_A3.CCI0A : CADENCE capture
    P2REN |=  BIT0;               // pull up enable
    P2OUT |=  BIT0;               // pull VDD

    P2DIR &= ~BIT0;               // P2.0 set to TimerA_A3.CCI0A
    P2SEL |= BIT0;                // P2.0 Select ACLK function for pin

    __delay_cycles(500000);       // Delay between comm cycles

    Timer1_A_period_init();

    // interrupt enable
    //P1.3
    P1IE  |= BIT3;                // enable interrupt
    P1REN |= BIT3;                // interrupt Resistor Enable

    //P2.2 
    P2IE  |= BIT2;                // enable interrupt

    P1OUT &= ~BIT0;               //LED OFF P1.0

    for (;;)
    {
        __low_power_mode_3();
    }

}

//------------------------------------------------------------------------------
// PORT1 mode change capture P1.3
//------------------------------------------------------------------------------

#pragma vector=PORT1_VECTOR
__interrupt void Port_1(void)
{
    if(0 == (P1IFG & BIT3))                              // interrupt flag check
        return;                                          // not BIT3 when return

    P1IFG &= ~BIT3;   // clear flag

    /*need chattering timer?*/
    if(unqomode == OFFSETMODE)
    {
        P1OUT &= ~BIT0;                                  // LED_OFF
        Timer1_A_period_init();
        unqomode = CTMMODE;
    }
    else
    {
        P1OUT ^= BIT0;                                   // LED_ON
        Timer1_A_period_CAL_init();
        unqomode = OFFSETMODE;
    }
}


#pragma vector=PORT2_VECTOR
__interrupt void Port_2(void)
{
    if(0 == (P2IFG & BIT2))                              // interrupt flag check
        return;                                          // not BIT2 when return

    P2IFG &= ~BIT2;                                      // clear flag

