zaikou/msp430-launchpad-WiredSRM-ANTpuls-Converter/UnQo_TX_20131118_github_main.c
    new_timer = TA1CCR0;                                 // TIMER_A0->TIMER1_A0, TACCR0->TA1CCR0

    timer_diff = calc_time_diff(new_timer,old_timer);
    old_timer = new_timer;

    if(timer_diff > msecConv(TORQUE_TICKET_MASK_TIME))   //gap larger than "TORQUE_TICKET_MASK_TIME"msec
    {
        /*細かいパルス束で構成されているトルクチケットの先頭だけカウント*/
        TorqueTicket++;
        PulseCount = 1;                                  //Counter Clear
    }
    else
    {
        if(PulseCount >= 0xFFFE)
            PulseCount = 0xFFFF;                         //Overflow
        else
            PulseCount++;                                //Counter
    }

    if(PulseCount >= CADENCE_THRESHOLD_PULSE)
    {
        /*細かいパルス束がCADENCE_THRESHOLD_PULSE本以上あれば、ケイデンス*/
        P1OUT ^= BIT6;                                   // LED_ON

        Rotation_event_counter++;

        ctf_torque_ticks1 = TorqueTicket;
        TorqueTicket = 0;                                // added for reset

        ctf_time_stamp1 = (uint16_t)((calc_time_diff(new_timer,old_transmit_timer)) / 2);

        old_transmit_timer = new_timer;

        sendPower_CTF1();
    }
}


//------------------------------------------------------------------------------
// Timer1_A timer interrupt 4Hz each 250msec
//------------------------------------------------------------------------------
#pragma vector=TIMER1_A0_VECTOR
__interrupt void TIMER1_A0(void)
{
    if(0 == (TACTL & TAIFG))                              // interrupt flag check
        return;

    TACTL &= ~TAIFG;

    if(unqomode == OFFSETMODE)
    {
      if(chatter_count13 == 0)
      {
          chatter_count13 = 1;
          P1OUT ^= BIT6;                                   // LED_ON
      }
      else
      {
          chatter_count13 = 0;
          P1OUT &= ~BIT6;                                   // LED_OFF
      }

      ctf_torque_ticks2 = TorqueTicket;
      sendPower_CTF1_CAL();

//        /*for test*/
//        Rotation_event_counter++;
//
//        ctf_torque_ticks1 = 1234;
//        ctf_time_stamp1 = (uint16_t)(500 / 2);
//
//        sendPower_CTF1();

    }
}


//------------------------------------------------------------------------------
// Function configures Timer1_A for CTM period capture
//------------------------------------------------------------------------------
void Timer1_A_period_init(void)
{
//    TA1CCTL0 = CM_1 + SCS + CCIS_0 + CAP + CCIE;  // Rising edge + Timer1_A3.CCI0A (P2.0)
//                                                  // + Capture Mode + Interrupt
    TA1CCTL0 = 0;
    TA1CCTL1 = 0;
    TA1CCTL2 = 0;
    TA1CTL = TASSEL_1 + MC_2;                       // ACLK, Continus up mode
}


 //------------------------------------------------------------------------------
 // Function configures Timer1_A for cal period capture
 //------------------------------------------------------------------------------
void Timer1_A_period_CAL_init(void)
{
//    TA1CCTL0 = CM_1 + SCS + CCIS_0 + CAP + CCIE;  // Rising edge + Timer1_A3.CCI0A (P2.0)
                                                    // + Capture Mode + Interrupt

    TA1CCR0 = kPeriod;                              // set interrupt cycle
    TA1CCTL0 = CCIE + OUTMOD_3;                     // enable interrupt + PWM toggle/reset
    TA1CCTL1 = 0;
    TA1CCTL2 = 0;

    TA1CTL = TASSEL_1 + MC_1;                       // ACLK, UP to CCR0

//  TA1CCTL0 = SCS + CCIS_0 + CAP + CCIE;  //Timer1_A3.CCI0A (P2.0)
                                                    // + Capture Mode + Interrupt

}

//------------------------------------------------------------------------------
// Function configures Timer_A for full-duplex UART operation
//------------------------------------------------------------------------------
void TimerA_UART_init(void)
{
    TACCTL0 = OUT;                          // Set TXD Idle as Mark = '1'
    TACCTL1 = SCS + CM1 + CAP + CCIE;       // Sync, Neg Edge, Capture, Int
    TACTL = TASSEL_2 + MC_2;                // SMCLK, start in continuous mode
}

//------------------------------------------------------------------------------
// Outputs one byte using the Timer_A UART
//------------------------------------------------------------------------------
void TimerA_UART_tx(unsigned char byte)
{
    while (TACCTL0 & CCIE);                 // Ensure last char got TX'd
    TACCR0 = TAR;                           // Current state of TA counter
    TACCR0 += UART_TBIT;                    // One bit time till first bit
    TACCTL0 = OUTMOD0 + CCIE;               // Set TXD on EQU0, Int
    txData = byte;                          // Load global variable
    txData |= 0x100;                        // Add mark stop bit to TXData
    txData <<= 1;                           // Add space start bit
}

//------------------------------------------------------------------------------
// Timer_A UART - Transmit Interrupt Handler
//------------------------------------------------------------------------------
#pragma vector = TIMER0_A0_VECTOR
__interrupt void Timer_A0_ISR(void)
{
    static unsigned char txBitCnt = 10;

    TACCR0 += UART_TBIT;                    // Add Offset to CCRx
    if (txBitCnt == 0) {                    // All bits TXed
        TACCTL0 &= ~CCIE;                   // All bits TXed, disable interrupt
        txBitCnt = 10;                      // Re-load bit counter
    }
    else {
        if (txData & 0x01) {
          TACCTL0 &= ~OUTMOD2;              // TX Mark '1'
        }
        else {
          TACCTL0 |= OUTMOD2;               // TX Space '0'
        }
        txData >>= 1;
        txBitCnt--;
    }
}

//------------------------------------------------------------------------------
// Timer_A UART - Receive Interrupt Handler
//------------------------------------------------------------------------------
#pragma vector = TIMER0_A1_VECTOR
__interrupt void Timer_A1_ISR(void)
{
    static unsigned char rxBitCnt = 8;
    static unsigned char rxData = 0;

    switch (__even_in_range(TA0IV, TA0IV_TAIFG)) { // Use calculated branching
        case TA0IV_TACCR1:                         // TACCR1 CCIFG - UART RX
            TACCR1 += UART_TBIT;                   // Add Offset to CCRx
            if (TACCTL1 & CAP) {                   // Capture mode = start bit edge
                TACCTL1 &= ~CAP;                   // Switch capture to compare mode
                TACCR1 += UART_TBIT_DIV_2;         // Point CCRx to middle of D0
            }
            else {
                rxData >>= 1;
                if (TACCTL1 & SCCI) {              // Get bit waiting in receive latch
                    rxData |= 0x80;
                }
                rxBitCnt--;
                if (rxBitCnt == 0) {               // All bits RXed
                    rxBuffer = rxData;             // Store in global variable
                    rxBitCnt = 8;                  // Re-load bit counter
                    TACCTL1 |= CAP;                // Switch compare to capture mode
                    __bic_SR_register_on_exit(LPM0_bits);  // Clear LPM0 bits from 0(SR)
                }
            }
            break;
    }
}
